Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/**
 * \file IfxPms_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:05:57 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Pms_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Pms_Registers
 * 
 */
#ifndef IFXPMS_BF_H
#define IFXPMS_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pms_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVRC */
#define IFX_PMS_EVR_STAT_EVRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRC */
#define IFX_PMS_EVR_STAT_EVRC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRC */
#define IFX_PMS_EVR_STAT_EVRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVRC */
#define IFX_PMS_EVR_STAT_EVRC_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.OVC */
#define IFX_PMS_EVR_STAT_OVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVC */
#define IFX_PMS_EVR_STAT_OVC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVC */
#define IFX_PMS_EVR_STAT_OVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.OVC */
#define IFX_PMS_EVR_STAT_OVC_OFF (1u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVR33 */
#define IFX_PMS_EVR_STAT_EVR33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33 */
#define IFX_PMS_EVR_STAT_EVR33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33 */
#define IFX_PMS_EVR_STAT_EVR33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVR33 */
#define IFX_PMS_EVR_STAT_EVR33_OFF (2u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.OV33 */
#define IFX_PMS_EVR_STAT_OV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OV33 */
#define IFX_PMS_EVR_STAT_OV33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OV33 */
#define IFX_PMS_EVR_STAT_OV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.OV33 */
#define IFX_PMS_EVR_STAT_OV33_OFF (3u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.OVSWD */
#define IFX_PMS_EVR_STAT_OVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVSWD */
#define IFX_PMS_EVR_STAT_OVSWD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVSWD */
#define IFX_PMS_EVR_STAT_OVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.OVSWD */
#define IFX_PMS_EVR_STAT_OVSWD_OFF (4u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.UVC */
#define IFX_PMS_EVR_STAT_UVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVC */
#define IFX_PMS_EVR_STAT_UVC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVC */
#define IFX_PMS_EVR_STAT_UVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.UVC */
#define IFX_PMS_EVR_STAT_UVC_OFF (5u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.UV33 */
#define IFX_PMS_EVR_STAT_UV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UV33 */
#define IFX_PMS_EVR_STAT_UV33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UV33 */
#define IFX_PMS_EVR_STAT_UV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.UV33 */
#define IFX_PMS_EVR_STAT_UV33_OFF (6u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.UVSWD */
#define IFX_PMS_EVR_STAT_UVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVSWD */
#define IFX_PMS_EVR_STAT_UVSWD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVSWD */
#define IFX_PMS_EVR_STAT_UVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.UVSWD */
#define IFX_PMS_EVR_STAT_UVSWD_OFF (7u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.SYNCLCK */
#define IFX_PMS_EVR_STAT_SYNCLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.SYNCLCK */
#define IFX_PMS_EVR_STAT_SYNCLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.SYNCLCK */
#define IFX_PMS_EVR_STAT_SYNCLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.SYNCLCK */
#define IFX_PMS_EVR_STAT_SYNCLCK_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVR33VOK */
#define IFX_PMS_EVR_STAT_EVR33VOK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33VOK */
#define IFX_PMS_EVR_STAT_EVR33VOK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33VOK */
#define IFX_PMS_EVR_STAT_EVR33VOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVR33VOK */
#define IFX_PMS_EVR_STAT_EVR33VOK_OFF (9u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.RSTC */
#define IFX_PMS_EVR_STAT_RSTC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.RSTC */
#define IFX_PMS_EVR_STAT_RSTC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.RSTC */
#define IFX_PMS_EVR_STAT_RSTC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.RSTC */
#define IFX_PMS_EVR_STAT_RSTC_OFF (13u)

