Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVR_STAT_Bits.RST33 */
#define IFX_PMS_EVR_STAT_RST33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.RST33 */
#define IFX_PMS_EVR_STAT_RST33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.RST33 */
#define IFX_PMS_EVR_STAT_RST33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.RST33 */
#define IFX_PMS_EVR_STAT_RST33_OFF (14u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.RSTSWD */
#define IFX_PMS_EVR_STAT_RSTSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.RSTSWD */
#define IFX_PMS_EVR_STAT_RSTSWD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.RSTSWD */
#define IFX_PMS_EVR_STAT_RSTSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.RSTSWD */
#define IFX_PMS_EVR_STAT_RSTSWD_OFF (15u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVRCSHLV */
#define IFX_PMS_EVR_STAT_EVRCSHLV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRCSHLV */
#define IFX_PMS_EVR_STAT_EVRCSHLV_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRCSHLV */
#define IFX_PMS_EVR_STAT_EVRCSHLV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVRCSHLV */
#define IFX_PMS_EVR_STAT_EVRCSHLV_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVRCSHHV */
#define IFX_PMS_EVR_STAT_EVRCSHHV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRCSHHV */
#define IFX_PMS_EVR_STAT_EVRCSHHV_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRCSHHV */
#define IFX_PMS_EVR_STAT_EVRCSHHV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVRCSHHV */
#define IFX_PMS_EVR_STAT_EVRCSHHV_OFF (17u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVR33SHLV */
#define IFX_PMS_EVR_STAT_EVR33SHLV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33SHLV */
#define IFX_PMS_EVR_STAT_EVR33SHLV_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33SHLV */
#define IFX_PMS_EVR_STAT_EVR33SHLV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVR33SHLV */
#define IFX_PMS_EVR_STAT_EVR33SHLV_OFF (18u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVR33SHHV */
#define IFX_PMS_EVR_STAT_EVR33SHHV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33SHHV */
#define IFX_PMS_EVR_STAT_EVR33SHHV_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVR33SHHV */
#define IFX_PMS_EVR_STAT_EVR33SHHV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVR33SHHV */
#define IFX_PMS_EVR_STAT_EVR33SHHV_OFF (19u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.SWDLVL */
#define IFX_PMS_EVR_STAT_SWDLVL_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.SWDLVL */
#define IFX_PMS_EVR_STAT_SWDLVL_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.SWDLVL */
#define IFX_PMS_EVR_STAT_SWDLVL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.SWDLVL */
#define IFX_PMS_EVR_STAT_SWDLVL_OFF (20u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.SDVOK */
#define IFX_PMS_EVR_STAT_SDVOK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.SDVOK */
#define IFX_PMS_EVR_STAT_SDVOK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.SDVOK */
#define IFX_PMS_EVR_STAT_SDVOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.SDVOK */
#define IFX_PMS_EVR_STAT_SDVOK_OFF (21u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.EVRCMOD */
#define IFX_PMS_EVR_STAT_EVRCMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRCMOD */
#define IFX_PMS_EVR_STAT_EVRCMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.EVRCMOD */
#define IFX_PMS_EVR_STAT_EVRCMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.EVRCMOD */
#define IFX_PMS_EVR_STAT_EVRCMOD_OFF (22u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.OVPRE */
#define IFX_PMS_EVR_STAT_OVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVPRE */
#define IFX_PMS_EVR_STAT_OVPRE_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVPRE */
#define IFX_PMS_EVR_STAT_OVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.OVPRE */
#define IFX_PMS_EVR_STAT_OVPRE_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.OVSB */
#define IFX_PMS_EVR_STAT_OVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVSB */
#define IFX_PMS_EVR_STAT_OVSB_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVSB */
#define IFX_PMS_EVR_STAT_OVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.OVSB */
#define IFX_PMS_EVR_STAT_OVSB_OFF (25u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.OVDDM */
#define IFX_PMS_EVR_STAT_OVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVDDM */
#define IFX_PMS_EVR_STAT_OVDDM_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.OVDDM */
#define IFX_PMS_EVR_STAT_OVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.OVDDM */
#define IFX_PMS_EVR_STAT_OVDDM_OFF (26u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.UVPRE */
#define IFX_PMS_EVR_STAT_UVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVPRE */
#define IFX_PMS_EVR_STAT_UVPRE_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVPRE */
#define IFX_PMS_EVR_STAT_UVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.UVPRE */
#define IFX_PMS_EVR_STAT_UVPRE_OFF (27u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.UVSB */
#define IFX_PMS_EVR_STAT_UVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVSB */
#define IFX_PMS_EVR_STAT_UVSB_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVSB */
#define IFX_PMS_EVR_STAT_UVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.UVSB */
#define IFX_PMS_EVR_STAT_UVSB_OFF (28u)

/** \brief Length for Ifx_PMS_EVR_STAT_Bits.UVDDM */
#define IFX_PMS_EVR_STAT_UVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVDDM */
#define IFX_PMS_EVR_STAT_UVDDM_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_STAT_Bits.UVDDM */
#define IFX_PMS_EVR_STAT_UVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_STAT_Bits.UVDDM */
#define IFX_PMS_EVR_STAT_UVDDM_OFF (29u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.ADCCV */
#define IFX_PMS_EVR_ADCSTAT_ADCCV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.ADCCV */
#define IFX_PMS_EVR_ADCSTAT_ADCCV_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.ADCCV */
#define IFX_PMS_EVR_ADCSTAT_ADCCV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.ADCCV */
#define IFX_PMS_EVR_ADCSTAT_ADCCV_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.ADC33V */
#define IFX_PMS_EVR_ADCSTAT_ADC33V_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.ADC33V */
#define IFX_PMS_EVR_ADCSTAT_ADC33V_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.ADC33V */
#define IFX_PMS_EVR_ADCSTAT_ADC33V_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.ADC33V */
#define IFX_PMS_EVR_ADCSTAT_ADC33V_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.ADCSWDV */
#define IFX_PMS_EVR_ADCSTAT_ADCSWDV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.ADCSWDV */
#define IFX_PMS_EVR_ADCSTAT_ADCSWDV_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.ADCSWDV */
#define IFX_PMS_EVR_ADCSTAT_ADCSWDV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.ADCSWDV */
#define IFX_PMS_EVR_ADCSTAT_ADCSWDV_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.OVC */
#define IFX_PMS_EVR_ADCSTAT_OVC_LEN (1u)

