Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.OVC */
#define IFX_PMS_EVR_ADCSTAT_OVC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.OVC */
#define IFX_PMS_EVR_ADCSTAT_OVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.OVC */
#define IFX_PMS_EVR_ADCSTAT_OVC_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.OV33 */
#define IFX_PMS_EVR_ADCSTAT_OV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.OV33 */
#define IFX_PMS_EVR_ADCSTAT_OV33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.OV33 */
#define IFX_PMS_EVR_ADCSTAT_OV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.OV33 */
#define IFX_PMS_EVR_ADCSTAT_OV33_OFF (25u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.OVSWD */
#define IFX_PMS_EVR_ADCSTAT_OVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.OVSWD */
#define IFX_PMS_EVR_ADCSTAT_OVSWD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.OVSWD */
#define IFX_PMS_EVR_ADCSTAT_OVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.OVSWD */
#define IFX_PMS_EVR_ADCSTAT_OVSWD_OFF (26u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.UVC */
#define IFX_PMS_EVR_ADCSTAT_UVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.UVC */
#define IFX_PMS_EVR_ADCSTAT_UVC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.UVC */
#define IFX_PMS_EVR_ADCSTAT_UVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.UVC */
#define IFX_PMS_EVR_ADCSTAT_UVC_OFF (27u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.UV33 */
#define IFX_PMS_EVR_ADCSTAT_UV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.UV33 */
#define IFX_PMS_EVR_ADCSTAT_UV33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.UV33 */
#define IFX_PMS_EVR_ADCSTAT_UV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.UV33 */
#define IFX_PMS_EVR_ADCSTAT_UV33_OFF (28u)

/** \brief Length for Ifx_PMS_EVR_ADCSTAT_Bits.UVSWD */
#define IFX_PMS_EVR_ADCSTAT_UVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.UVSWD */
#define IFX_PMS_EVR_ADCSTAT_UVSWD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_ADCSTAT_Bits.UVSWD */
#define IFX_PMS_EVR_ADCSTAT_UVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_ADCSTAT_Bits.UVSWD */
#define IFX_PMS_EVR_ADCSTAT_UVSWD_OFF (29u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.RSTCTRIM */
#define IFX_PMS_EVR_RSTCON_RSTCTRIM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTCTRIM */
#define IFX_PMS_EVR_RSTCON_RSTCTRIM_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTCTRIM */
#define IFX_PMS_EVR_RSTCON_RSTCTRIM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.RSTCTRIM */
#define IFX_PMS_EVR_RSTCON_RSTCTRIM_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.RST33TRIM */
#define IFX_PMS_EVR_RSTCON_RST33TRIM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RST33TRIM */
#define IFX_PMS_EVR_RSTCON_RST33TRIM_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RST33TRIM */
#define IFX_PMS_EVR_RSTCON_RST33TRIM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.RST33TRIM */
#define IFX_PMS_EVR_RSTCON_RST33TRIM_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDTRIM */
#define IFX_PMS_EVR_RSTCON_RSTSWDTRIM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDTRIM */
#define IFX_PMS_EVR_RSTCON_RSTSWDTRIM_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDTRIM */
#define IFX_PMS_EVR_RSTCON_RSTSWDTRIM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDTRIM */
#define IFX_PMS_EVR_RSTCON_RSTSWDTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTCON_RSTCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTCON_RSTCOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTCON_RSTCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTCON_RSTCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.BPRSTCOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.BPRSTCOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTCOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.BPRSTCOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.BPRSTCOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTCOFF_OFF (25u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTCON_RST33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTCON_RST33OFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTCON_RST33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTCON_RST33OFF_OFF (26u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.BPRST33OFF */
#define IFX_PMS_EVR_RSTCON_BPRST33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.BPRST33OFF */
#define IFX_PMS_EVR_RSTCON_BPRST33OFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.BPRST33OFF */
#define IFX_PMS_EVR_RSTCON_BPRST33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.BPRST33OFF */
#define IFX_PMS_EVR_RSTCON_BPRST33OFF_OFF (27u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_RSTSWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_RSTSWDOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_RSTSWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_RSTSWDOFF_OFF (28u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.BPRSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTSWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.BPRSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTSWDOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.BPRSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTSWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.BPRSTSWDOFF */
#define IFX_PMS_EVR_RSTCON_BPRSTSWDOFF_OFF (29u)

/** \brief Length for Ifx_PMS_EVR_RSTCON_Bits.SLCK */
#define IFX_PMS_EVR_RSTCON_SLCK_LEN (1u)

