Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.SLCK */
#define IFX_PMS_EVR_RSTCON_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTCON_Bits.SLCK */
#define IFX_PMS_EVR_RSTCON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTCON_Bits.SLCK */
#define IFX_PMS_EVR_RSTCON_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RSTC */
#define IFX_PMS_EVR_RSTSTAT_RSTC_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTC */
#define IFX_PMS_EVR_RSTSTAT_RSTC_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTC */
#define IFX_PMS_EVR_RSTSTAT_RSTC_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RSTC */
#define IFX_PMS_EVR_RSTSTAT_RSTC_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RST33 */
#define IFX_PMS_EVR_RSTSTAT_RST33_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RST33 */
#define IFX_PMS_EVR_RSTSTAT_RST33_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RST33 */
#define IFX_PMS_EVR_RSTSTAT_RST33_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RST33 */
#define IFX_PMS_EVR_RSTSTAT_RST33_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWD */
#define IFX_PMS_EVR_RSTSTAT_RSTSWD_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWD */
#define IFX_PMS_EVR_RSTSTAT_RSTSWD_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWD */
#define IFX_PMS_EVR_RSTSTAT_RSTSWD_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWD */
#define IFX_PMS_EVR_RSTSTAT_RSTSWD_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTCOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTCHYSEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTCHYSEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTCHYSEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RSTCHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTCHYSEN_OFF (25u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTSTAT_RST33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTSTAT_RST33OFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTSTAT_RST33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RST33OFF */
#define IFX_PMS_EVR_RSTSTAT_RST33OFF_OFF (26u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RST33HYSEN */
#define IFX_PMS_EVR_RSTSTAT_RST33HYSEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RST33HYSEN */
#define IFX_PMS_EVR_RSTSTAT_RST33HYSEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RST33HYSEN */
#define IFX_PMS_EVR_RSTSTAT_RST33HYSEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RST33HYSEN */
#define IFX_PMS_EVR_RSTSTAT_RST33HYSEN_OFF (27u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDOFF */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDOFF_OFF (28u)

/** \brief Length for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDHYSEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDHYSEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDHYSEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_RSTSTAT_Bits.RSTSWDHYSEN */
#define IFX_PMS_EVR_RSTSTAT_RSTSWDHYSEN_OFF (29u)

/** \brief Length for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIM_EVR33VOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIM_EVR33VOUTSEL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIM_EVR33VOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIM_EVR33VOUTSEL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_TRIM_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIM_SDVOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIM_SDVOUTSEL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIM_SDVOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_TRIM_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIM_SDVOUTSEL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIM_EVR33VOUTTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIM_EVR33VOUTTRIM_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIM_EVR33VOUTTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVR_TRIM_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIM_EVR33VOUTTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_TRIM_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIM_SDVOUTTRIM_LEN (5u)

/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIM_SDVOUTTRIM_MSK (0x1fu)
/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIM_SDVOUTTRIM_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVR_TRIM_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIM_SDVOUTTRIM_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_TRIM_Bits.SLCK */
#define IFX_PMS_EVR_TRIM_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.SLCK */
#define IFX_PMS_EVR_TRIM_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_TRIM_Bits.SLCK */
#define IFX_PMS_EVR_TRIM_SLCK_MSK (0x1u)

