Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVR_TRIM_Bits.SLCK */
#define IFX_PMS_EVR_TRIM_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTSEL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTSEL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTSEL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTSEL */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTSEL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTTRIM_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVR_TRIMSTAT_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_EVR33VOUTTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTTRIM_LEN (5u)

/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTTRIM_MSK (0x1fu)
/** \brief Mask for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTTRIM_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVR_TRIMSTAT_Bits.SDVOUTTRIM */
#define IFX_PMS_EVR_TRIMSTAT_SDVOUTTRIM_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_MONSTAT1_Bits.ADCCV */
#define IFX_PMS_EVR_MONSTAT1_ADCCV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ADCCV */
#define IFX_PMS_EVR_MONSTAT1_ADCCV_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ADCCV */
#define IFX_PMS_EVR_MONSTAT1_ADCCV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_MONSTAT1_Bits.ADCCV */
#define IFX_PMS_EVR_MONSTAT1_ADCCV_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_MONSTAT1_Bits.ADC33V */
#define IFX_PMS_EVR_MONSTAT1_ADC33V_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ADC33V */
#define IFX_PMS_EVR_MONSTAT1_ADC33V_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ADC33V */
#define IFX_PMS_EVR_MONSTAT1_ADC33V_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_MONSTAT1_Bits.ADC33V */
#define IFX_PMS_EVR_MONSTAT1_ADC33V_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_MONSTAT1_Bits.ADCSWDV */
#define IFX_PMS_EVR_MONSTAT1_ADCSWDV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ADCSWDV */
#define IFX_PMS_EVR_MONSTAT1_ADCSWDV_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ADCSWDV */
#define IFX_PMS_EVR_MONSTAT1_ADCSWDV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_MONSTAT1_Bits.ADCSWDV */
#define IFX_PMS_EVR_MONSTAT1_ADCSWDV_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_MONSTAT1_Bits.ACTVCNT */
#define IFX_PMS_EVR_MONSTAT1_ACTVCNT_LEN (6u)

/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ACTVCNT */
#define IFX_PMS_EVR_MONSTAT1_ACTVCNT_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVR_MONSTAT1_Bits.ACTVCNT */
#define IFX_PMS_EVR_MONSTAT1_ACTVCNT_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVR_MONSTAT1_Bits.ACTVCNT */
#define IFX_PMS_EVR_MONSTAT1_ACTVCNT_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_MONSTAT2_Bits.ADCPRE */
#define IFX_PMS_EVR_MONSTAT2_ADCPRE_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_MONSTAT2_Bits.ADCPRE */
#define IFX_PMS_EVR_MONSTAT2_ADCPRE_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_MONSTAT2_Bits.ADCPRE */
#define IFX_PMS_EVR_MONSTAT2_ADCPRE_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_MONSTAT2_Bits.ADCPRE */
#define IFX_PMS_EVR_MONSTAT2_ADCPRE_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_MONSTAT2_Bits.ADCSB */
#define IFX_PMS_EVR_MONSTAT2_ADCSB_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_MONSTAT2_Bits.ADCSB */
#define IFX_PMS_EVR_MONSTAT2_ADCSB_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_MONSTAT2_Bits.ADCSB */
#define IFX_PMS_EVR_MONSTAT2_ADCSB_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_MONSTAT2_Bits.ADCSB */
#define IFX_PMS_EVR_MONSTAT2_ADCSB_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_MONSTAT2_Bits.ADCVDDM */
#define IFX_PMS_EVR_MONSTAT2_ADCVDDM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_MONSTAT2_Bits.ADCVDDM */
#define IFX_PMS_EVR_MONSTAT2_ADCVDDM_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_MONSTAT2_Bits.ADCVDDM */
#define IFX_PMS_EVR_MONSTAT2_ADCVDDM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_MONSTAT2_Bits.ADCVDDM */
#define IFX_PMS_EVR_MONSTAT2_ADCVDDM_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.EVRCOVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVRCOVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCOVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVRCOVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.EVRCOVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCOVMOD_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.PREOVMOD */
#define IFX_PMS_EVR_MONCTRL_PREOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.PREOVMOD */
#define IFX_PMS_EVR_MONCTRL_PREOVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.PREOVMOD */
#define IFX_PMS_EVR_MONCTRL_PREOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.PREOVMOD */
#define IFX_PMS_EVR_MONCTRL_PREOVMOD_OFF (2u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.EVRCUVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVRCUVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCUVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVRCUVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.EVRCUVMOD */
#define IFX_PMS_EVR_MONCTRL_EVRCUVMOD_OFF (4u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.PREUVMOD */
#define IFX_PMS_EVR_MONCTRL_PREUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.PREUVMOD */
#define IFX_PMS_EVR_MONCTRL_PREUVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.PREUVMOD */
#define IFX_PMS_EVR_MONCTRL_PREUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.PREUVMOD */
#define IFX_PMS_EVR_MONCTRL_PREUVMOD_OFF (6u)

