Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.EVR33OVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33OVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVR33OVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33OVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVR33OVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33OVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.EVR33OVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33OVMOD_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.VDDMOVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.VDDMOVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMOVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.VDDMOVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.VDDMOVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMOVMOD_OFF (10u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.EVR33UVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33UVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVR33UVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33UVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.EVR33UVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33UVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.EVR33UVMOD */
#define IFX_PMS_EVR_MONCTRL_EVR33UVMOD_OFF (12u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.VDDMUVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.VDDMUVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMUVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.VDDMUVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.VDDMUVMOD */
#define IFX_PMS_EVR_MONCTRL_VDDMUVMOD_OFF (14u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.SWDOVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SWDOVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDOVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SWDOVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.SWDOVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDOVMOD_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.SBOVMOD */
#define IFX_PMS_EVR_MONCTRL_SBOVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SBOVMOD */
#define IFX_PMS_EVR_MONCTRL_SBOVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SBOVMOD */
#define IFX_PMS_EVR_MONCTRL_SBOVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.SBOVMOD */
#define IFX_PMS_EVR_MONCTRL_SBOVMOD_OFF (18u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.SWDUVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SWDUVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDUVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SWDUVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.SWDUVMOD */
#define IFX_PMS_EVR_MONCTRL_SWDUVMOD_OFF (20u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.SBUVMOD */
#define IFX_PMS_EVR_MONCTRL_SBUVMOD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SBUVMOD */
#define IFX_PMS_EVR_MONCTRL_SBUVMOD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SBUVMOD */
#define IFX_PMS_EVR_MONCTRL_SBUVMOD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.SBUVMOD */
#define IFX_PMS_EVR_MONCTRL_SBUVMOD_OFF (22u)

/** \brief Length for Ifx_PMS_EVR_MONCTRL_Bits.SLCK */
#define IFX_PMS_EVR_MONCTRL_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SLCK */
#define IFX_PMS_EVR_MONCTRL_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_MONCTRL_Bits.SLCK */
#define IFX_PMS_EVR_MONCTRL_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_MONCTRL_Bits.SLCK */
#define IFX_PMS_EVR_MONCTRL_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.EVRCFIL */
#define IFX_PMS_EVR_MONFILT_EVRCFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.EVRCFIL */
#define IFX_PMS_EVR_MONFILT_EVRCFIL_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.EVRCFIL */
#define IFX_PMS_EVR_MONFILT_EVRCFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.EVRCFIL */
#define IFX_PMS_EVR_MONFILT_EVRCFIL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.PREFIL */
#define IFX_PMS_EVR_MONFILT_PREFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.PREFIL */
#define IFX_PMS_EVR_MONFILT_PREFIL_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.PREFIL */
#define IFX_PMS_EVR_MONFILT_PREFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.PREFIL */
#define IFX_PMS_EVR_MONFILT_PREFIL_OFF (4u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.EVR33FIL */
#define IFX_PMS_EVR_MONFILT_EVR33FIL_LEN (4u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.EVR33FIL */
#define IFX_PMS_EVR_MONFILT_EVR33FIL_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.EVR33FIL */
#define IFX_PMS_EVR_MONFILT_EVR33FIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.EVR33FIL */
#define IFX_PMS_EVR_MONFILT_EVR33FIL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.VDDMFIL */
#define IFX_PMS_EVR_MONFILT_VDDMFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.VDDMFIL */
#define IFX_PMS_EVR_MONFILT_VDDMFIL_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.VDDMFIL */
#define IFX_PMS_EVR_MONFILT_VDDMFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.VDDMFIL */
#define IFX_PMS_EVR_MONFILT_VDDMFIL_OFF (12u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.SWDFIL */
#define IFX_PMS_EVR_MONFILT_SWDFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.SWDFIL */
#define IFX_PMS_EVR_MONFILT_SWDFIL_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.SWDFIL */
#define IFX_PMS_EVR_MONFILT_SWDFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.SWDFIL */
#define IFX_PMS_EVR_MONFILT_SWDFIL_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.SBFIL */
#define IFX_PMS_EVR_MONFILT_SBFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.SBFIL */
#define IFX_PMS_EVR_MONFILT_SBFIL_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.SBFIL */
#define IFX_PMS_EVR_MONFILT_SBFIL_MSK (0xfu)

