Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.SBFIL */
#define IFX_PMS_EVR_MONFILT_SBFIL_OFF (20u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.CLRFIL */
#define IFX_PMS_EVR_MONFILT_CLRFIL_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.CLRFIL */
#define IFX_PMS_EVR_MONFILT_CLRFIL_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.CLRFIL */
#define IFX_PMS_EVR_MONFILT_CLRFIL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.CLRFIL */
#define IFX_PMS_EVR_MONFILT_CLRFIL_OFF (29u)

/** \brief Length for Ifx_PMS_EVR_MONFILT_Bits.SLCK */
#define IFX_PMS_EVR_MONFILT_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.SLCK */
#define IFX_PMS_EVR_MONFILT_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_MONFILT_Bits.SLCK */
#define IFX_PMS_EVR_MONFILT_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_MONFILT_Bits.SLCK */
#define IFX_PMS_EVR_MONFILT_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.OVSWD */
#define IFX_PMS_EVR_PMSIEN_OVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVSWD */
#define IFX_PMS_EVR_PMSIEN_OVSWD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVSWD */
#define IFX_PMS_EVR_PMSIEN_OVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.OVSWD */
#define IFX_PMS_EVR_PMSIEN_OVSWD_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.UVSWD */
#define IFX_PMS_EVR_PMSIEN_UVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVSWD */
#define IFX_PMS_EVR_PMSIEN_UVSWD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVSWD */
#define IFX_PMS_EVR_PMSIEN_UVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.UVSWD */
#define IFX_PMS_EVR_PMSIEN_UVSWD_OFF (1u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.OV33 */
#define IFX_PMS_EVR_PMSIEN_OV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OV33 */
#define IFX_PMS_EVR_PMSIEN_OV33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OV33 */
#define IFX_PMS_EVR_PMSIEN_OV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.OV33 */
#define IFX_PMS_EVR_PMSIEN_OV33_OFF (2u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.UV33 */
#define IFX_PMS_EVR_PMSIEN_UV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UV33 */
#define IFX_PMS_EVR_PMSIEN_UV33_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UV33 */
#define IFX_PMS_EVR_PMSIEN_UV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.UV33 */
#define IFX_PMS_EVR_PMSIEN_UV33_OFF (3u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.OVC */
#define IFX_PMS_EVR_PMSIEN_OVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVC */
#define IFX_PMS_EVR_PMSIEN_OVC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVC */
#define IFX_PMS_EVR_PMSIEN_OVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.OVC */
#define IFX_PMS_EVR_PMSIEN_OVC_OFF (4u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.UVC */
#define IFX_PMS_EVR_PMSIEN_UVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVC */
#define IFX_PMS_EVR_PMSIEN_UVC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVC */
#define IFX_PMS_EVR_PMSIEN_UVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.UVC */
#define IFX_PMS_EVR_PMSIEN_UVC_OFF (5u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.OVPRE */
#define IFX_PMS_EVR_PMSIEN_OVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVPRE */
#define IFX_PMS_EVR_PMSIEN_OVPRE_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVPRE */
#define IFX_PMS_EVR_PMSIEN_OVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.OVPRE */
#define IFX_PMS_EVR_PMSIEN_OVPRE_OFF (6u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.UVPRE */
#define IFX_PMS_EVR_PMSIEN_UVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVPRE */
#define IFX_PMS_EVR_PMSIEN_UVPRE_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVPRE */
#define IFX_PMS_EVR_PMSIEN_UVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.UVPRE */
#define IFX_PMS_EVR_PMSIEN_UVPRE_OFF (7u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.OVDDM */
#define IFX_PMS_EVR_PMSIEN_OVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVDDM */
#define IFX_PMS_EVR_PMSIEN_OVDDM_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVDDM */
#define IFX_PMS_EVR_PMSIEN_OVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.OVDDM */
#define IFX_PMS_EVR_PMSIEN_OVDDM_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.UVDDM */
#define IFX_PMS_EVR_PMSIEN_UVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVDDM */
#define IFX_PMS_EVR_PMSIEN_UVDDM_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVDDM */
#define IFX_PMS_EVR_PMSIEN_UVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.UVDDM */
#define IFX_PMS_EVR_PMSIEN_UVDDM_OFF (9u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.OVSB */
#define IFX_PMS_EVR_PMSIEN_OVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVSB */
#define IFX_PMS_EVR_PMSIEN_OVSB_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.OVSB */
#define IFX_PMS_EVR_PMSIEN_OVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.OVSB */
#define IFX_PMS_EVR_PMSIEN_OVSB_OFF (10u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.UVSB */
#define IFX_PMS_EVR_PMSIEN_UVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVSB */
#define IFX_PMS_EVR_PMSIEN_UVSB_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.UVSB */
#define IFX_PMS_EVR_PMSIEN_UVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.UVSB */
#define IFX_PMS_EVR_PMSIEN_UVSB_OFF (11u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.EVRCMOD */
#define IFX_PMS_EVR_PMSIEN_EVRCMOD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.EVRCMOD */
#define IFX_PMS_EVR_PMSIEN_EVRCMOD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.EVRCMOD */
#define IFX_PMS_EVR_PMSIEN_EVRCMOD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.EVRCMOD */
#define IFX_PMS_EVR_PMSIEN_EVRCMOD_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_PMSIEN_Bits.SDVOK */
#define IFX_PMS_EVR_PMSIEN_SDVOK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.SDVOK */
#define IFX_PMS_EVR_PMSIEN_SDVOK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_PMSIEN_Bits.SDVOK */
#define IFX_PMS_EVR_PMSIEN_SDVOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_PMSIEN_Bits.SDVOK */
#define IFX_PMS_EVR_PMSIEN_SDVOK_OFF (17u)

