Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVR_OVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_OVMON_EVR33OVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_OVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_OVMON_EVR33OVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_OVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_OVMON_EVR33OVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_OVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_OVMON_EVR33OVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_OVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_OVMON_SWDOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_OVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_OVMON_SWDOVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_OVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_OVMON_SWDOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_OVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_OVMON_SWDOVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_OVMON_Bits.SLCK */
#define IFX_PMS_EVR_OVMON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_OVMON_Bits.SLCK */
#define IFX_PMS_EVR_OVMON_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_OVMON_Bits.SLCK */
#define IFX_PMS_EVR_OVMON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_OVMON_Bits.SLCK */
#define IFX_PMS_EVR_OVMON_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_UVMON2_Bits.PREUVVAL */
#define IFX_PMS_EVR_UVMON2_PREUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.PREUVVAL */
#define IFX_PMS_EVR_UVMON2_PREUVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.PREUVVAL */
#define IFX_PMS_EVR_UVMON2_PREUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_UVMON2_Bits.PREUVVAL */
#define IFX_PMS_EVR_UVMON2_PREUVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_UVMON2_Bits.VDDMUVVAL */
#define IFX_PMS_EVR_UVMON2_VDDMUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.VDDMUVVAL */
#define IFX_PMS_EVR_UVMON2_VDDMUVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.VDDMUVVAL */
#define IFX_PMS_EVR_UVMON2_VDDMUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_UVMON2_Bits.VDDMUVVAL */
#define IFX_PMS_EVR_UVMON2_VDDMUVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_UVMON2_Bits.SBUVVAL */
#define IFX_PMS_EVR_UVMON2_SBUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.SBUVVAL */
#define IFX_PMS_EVR_UVMON2_SBUVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.SBUVVAL */
#define IFX_PMS_EVR_UVMON2_SBUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_UVMON2_Bits.SBUVVAL */
#define IFX_PMS_EVR_UVMON2_SBUVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_UVMON2_Bits.VDDMLVLSEL */
#define IFX_PMS_EVR_UVMON2_VDDMLVLSEL_LEN (6u)

/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.VDDMLVLSEL */
#define IFX_PMS_EVR_UVMON2_VDDMLVLSEL_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.VDDMLVLSEL */
#define IFX_PMS_EVR_UVMON2_VDDMLVLSEL_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVR_UVMON2_Bits.VDDMLVLSEL */
#define IFX_PMS_EVR_UVMON2_VDDMLVLSEL_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_UVMON2_Bits.SLCK */
#define IFX_PMS_EVR_UVMON2_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.SLCK */
#define IFX_PMS_EVR_UVMON2_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_UVMON2_Bits.SLCK */
#define IFX_PMS_EVR_UVMON2_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_UVMON2_Bits.SLCK */
#define IFX_PMS_EVR_UVMON2_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_OVMON2_Bits.PREOVVAL */
#define IFX_PMS_EVR_OVMON2_PREOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.PREOVVAL */
#define IFX_PMS_EVR_OVMON2_PREOVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.PREOVVAL */
#define IFX_PMS_EVR_OVMON2_PREOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_OVMON2_Bits.PREOVVAL */
#define IFX_PMS_EVR_OVMON2_PREOVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_OVMON2_Bits.VDDMOVVAL */
#define IFX_PMS_EVR_OVMON2_VDDMOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.VDDMOVVAL */
#define IFX_PMS_EVR_OVMON2_VDDMOVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.VDDMOVVAL */
#define IFX_PMS_EVR_OVMON2_VDDMOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_OVMON2_Bits.VDDMOVVAL */
#define IFX_PMS_EVR_OVMON2_VDDMOVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_OVMON2_Bits.SBOVVAL */
#define IFX_PMS_EVR_OVMON2_SBOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.SBOVVAL */
#define IFX_PMS_EVR_OVMON2_SBOVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.SBOVVAL */
#define IFX_PMS_EVR_OVMON2_SBOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_OVMON2_Bits.SBOVVAL */
#define IFX_PMS_EVR_OVMON2_SBOVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_OVMON2_Bits.SLCK */
#define IFX_PMS_EVR_OVMON2_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.SLCK */
#define IFX_PMS_EVR_OVMON2_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_OVMON2_Bits.SLCK */
#define IFX_PMS_EVR_OVMON2_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_OVMON2_Bits.SLCK */
#define IFX_PMS_EVR_OVMON2_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCUVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVRCUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCUVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVRCUVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCUVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVRCUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCUVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVRCUVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33UVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVR33UVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33UVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVR33UVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33UVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVR33UVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33UVVAL */
#define IFX_PMS_EVR_HSMUVMON_EVR33UVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.SWDUVVAL */
#define IFX_PMS_EVR_HSMUVMON_SWDUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.SWDUVVAL */
#define IFX_PMS_EVR_HSMUVMON_SWDUVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.SWDUVVAL */
#define IFX_PMS_EVR_HSMUVMON_SWDUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.SWDUVVAL */
#define IFX_PMS_EVR_HSMUVMON_SWDUVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMUVMON_EVRCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMUVMON_EVRCOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMUVMON_EVRCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMUVMON_EVRCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMUVMON_EVR33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMUVMON_EVR33OFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMUVMON_EVR33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMUVMON_EVR33OFF_OFF (25u)

