Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMUVMON_SWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMUVMON_SWDOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMUVMON_SWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMUVMON_SWDOFF_OFF (26u)

/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.HSMFIL */
#define IFX_PMS_EVR_HSMUVMON_HSMFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.HSMFIL */
#define IFX_PMS_EVR_HSMUVMON_HSMFIL_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.HSMFIL */
#define IFX_PMS_EVR_HSMUVMON_HSMFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.HSMFIL */
#define IFX_PMS_EVR_HSMUVMON_HSMFIL_OFF (27u)

/** \brief Length for Ifx_PMS_EVR_HSMUVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMUVMON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMUVMON_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMUVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMUVMON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMUVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMUVMON_SLCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVRCOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVRCOVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVRCOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVRCOVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVR33OVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVR33OVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVR33OVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OVVAL */
#define IFX_PMS_EVR_HSMOVMON_EVR33OVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_HSMOVMON_SWDOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_HSMOVMON_SWDOVVAL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_HSMOVMON_SWDOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOVVAL */
#define IFX_PMS_EVR_HSMOVMON_SWDOVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMOVMON_EVRCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMOVMON_EVRCOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMOVMON_EVRCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMOVMON_Bits.EVRCOFF */
#define IFX_PMS_EVR_HSMOVMON_EVRCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMOVMON_EVR33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMOVMON_EVR33OFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMOVMON_EVR33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMOVMON_Bits.EVR33OFF */
#define IFX_PMS_EVR_HSMOVMON_EVR33OFF_OFF (25u)

/** \brief Length for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMOVMON_SWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMOVMON_SWDOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMOVMON_SWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMOVMON_Bits.SWDOFF */
#define IFX_PMS_EVR_HSMOVMON_SWDOFF_OFF (26u)

/** \brief Length for Ifx_PMS_EVR_HSMOVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMOVMON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMOVMON_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVR_HSMOVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMOVMON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_HSMOVMON_Bits.SLCK */
#define IFX_PMS_EVR_HSMOVMON_SLCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVR_ANACTRL_Bits.CONTROL */
#define IFX_PMS_EVR_ANACTRL_CONTROL_LEN (32u)

/** \brief Mask for Ifx_PMS_EVR_ANACTRL_Bits.CONTROL */
#define IFX_PMS_EVR_ANACTRL_CONTROL_MSK (0xffffffffu)

/** \brief Offset for Ifx_PMS_EVR_ANACTRL_Bits.CONTROL */
#define IFX_PMS_EVR_ANACTRL_CONTROL_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.VBGTRIM */
#define IFX_PMS_EVR_BGOCTRL_VBGTRIM_LEN (7u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.VBGTRIM */
#define IFX_PMS_EVR_BGOCTRL_VBGTRIM_MSK (0x7fu)

/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.VBGTRIM */
#define IFX_PMS_EVR_BGOCTRL_VBGTRIM_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.OSCCTRIM */
#define IFX_PMS_EVR_BGOCTRL_OSCCTRIM_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.OSCCTRIM */
#define IFX_PMS_EVR_BGOCTRL_OSCCTRIM_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.OSCCTRIM */
#define IFX_PMS_EVR_BGOCTRL_OSCCTRIM_OFF (8u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.IREFTRIM */
#define IFX_PMS_EVR_BGOCTRL_IREFTRIM_LEN (5u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.IREFTRIM */
#define IFX_PMS_EVR_BGOCTRL_IREFTRIM_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.IREFTRIM */
#define IFX_PMS_EVR_BGOCTRL_IREFTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.VBGPTRIM */
#define IFX_PMS_EVR_BGOCTRL_VBGPTRIM_LEN (5u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.VBGPTRIM */
#define IFX_PMS_EVR_BGOCTRL_VBGPTRIM_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.VBGPTRIM */
#define IFX_PMS_EVR_BGOCTRL_VBGPTRIM_OFF (21u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.OSCTEMPTRIM */
#define IFX_PMS_EVR_BGOCTRL_OSCTEMPTRIM_LEN (3u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.OSCTEMPTRIM */
#define IFX_PMS_EVR_BGOCTRL_OSCTEMPTRIM_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.OSCTEMPTRIM */
#define IFX_PMS_EVR_BGOCTRL_OSCTEMPTRIM_OFF (26u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.OSCTEMPSIGN */
#define IFX_PMS_EVR_BGOCTRL_OSCTEMPSIGN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.OSCTEMPSIGN */
#define IFX_PMS_EVR_BGOCTRL_OSCTEMPSIGN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.OSCTEMPSIGN */
#define IFX_PMS_EVR_BGOCTRL_OSCTEMPSIGN_OFF (29u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.SLCK */
#define IFX_PMS_EVR_BGOCTRL_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.SLCK */
#define IFX_PMS_EVR_BGOCTRL_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.SLCK */
#define IFX_PMS_EVR_BGOCTRL_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVR_BGOCTRL_Bits.ENVICHOP */
#define IFX_PMS_EVR_BGOCTRL_ENVICHOP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_BGOCTRL_Bits.ENVICHOP */
#define IFX_PMS_EVR_BGOCTRL_ENVICHOP_MSK (0x1u)

