Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVR_BGOCTRL_Bits.ENVICHOP */
#define IFX_PMS_EVR_BGOCTRL_ENVICHOP_OFF (31u)

/** \brief Length for Ifx_PMS_EVR_OSCCTRL_Bits.OSCFTRIM */
#define IFX_PMS_EVR_OSCCTRL_OSCFTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVR_OSCCTRL_Bits.OSCFTRIM */
#define IFX_PMS_EVR_OSCCTRL_OSCFTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVR_OSCCTRL_Bits.OSCFTRIM */
#define IFX_PMS_EVR_OSCCTRL_OSCFTRIM_OFF (0u)

/** \brief Length for Ifx_PMS_EVR_OSCCTRL_Bits.OSCFPTRIM */
#define IFX_PMS_EVR_OSCCTRL_OSCFPTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVR_OSCCTRL_Bits.OSCFPTRIM */
#define IFX_PMS_EVR_OSCCTRL_OSCFPTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVR_OSCCTRL_Bits.OSCFPTRIM */
#define IFX_PMS_EVR_OSCCTRL_OSCFPTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVR_OSCCTRL_Bits.OSCTRIMEN */
#define IFX_PMS_EVR_OSCCTRL_OSCTRIMEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR_OSCCTRL_Bits.OSCTRIMEN */
#define IFX_PMS_EVR_OSCCTRL_OSCTRIMEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR_OSCCTRL_Bits.OSCTRIMEN */
#define IFX_PMS_EVR_OSCCTRL_OSCTRIMEN_OFF (31u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR0 */
#define IFX_PMS_EVROSCCTRL2_OSCTR0_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR0 */
#define IFX_PMS_EVROSCCTRL2_OSCTR0_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR0 */
#define IFX_PMS_EVROSCCTRL2_OSCTR0_OFF (0u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR1 */
#define IFX_PMS_EVROSCCTRL2_OSCTR1_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR1 */
#define IFX_PMS_EVROSCCTRL2_OSCTR1_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR1 */
#define IFX_PMS_EVROSCCTRL2_OSCTR1_OFF (3u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR2 */
#define IFX_PMS_EVROSCCTRL2_OSCTR2_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR2 */
#define IFX_PMS_EVROSCCTRL2_OSCTR2_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR2 */
#define IFX_PMS_EVROSCCTRL2_OSCTR2_OFF (6u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR3 */
#define IFX_PMS_EVROSCCTRL2_OSCTR3_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR3 */
#define IFX_PMS_EVROSCCTRL2_OSCTR3_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR3 */
#define IFX_PMS_EVROSCCTRL2_OSCTR3_OFF (9u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR4 */
#define IFX_PMS_EVROSCCTRL2_OSCTR4_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR4 */
#define IFX_PMS_EVROSCCTRL2_OSCTR4_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR4 */
#define IFX_PMS_EVROSCCTRL2_OSCTR4_OFF (12u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR5 */
#define IFX_PMS_EVROSCCTRL2_OSCTR5_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR5 */
#define IFX_PMS_EVROSCCTRL2_OSCTR5_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR5 */
#define IFX_PMS_EVROSCCTRL2_OSCTR5_OFF (15u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR6 */
#define IFX_PMS_EVROSCCTRL2_OSCTR6_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR6 */
#define IFX_PMS_EVROSCCTRL2_OSCTR6_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR6 */
#define IFX_PMS_EVROSCCTRL2_OSCTR6_OFF (18u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR7 */
#define IFX_PMS_EVROSCCTRL2_OSCTR7_LEN (3u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR7 */
#define IFX_PMS_EVROSCCTRL2_OSCTR7_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.OSCTR7 */
#define IFX_PMS_EVROSCCTRL2_OSCTR7_OFF (21u)

/** \brief Length for Ifx_PMS_EVROSCCTRL2_Bits.SLCK */
#define IFX_PMS_EVROSCCTRL2_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL2_Bits.SLCK */
#define IFX_PMS_EVROSCCTRL2_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL2_Bits.SLCK */
#define IFX_PMS_EVROSCCTRL2_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR0 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR0_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR0 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR0_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR0 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR0_OFF (0u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR1 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR1_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR1 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR1_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR1 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR1_OFF (3u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR2 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR2_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR2 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR2_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR2 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR2_OFF (6u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR3 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR3_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR3 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR3_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR3 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR3_OFF (9u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR4 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR4_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR4 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR4_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR4 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR4_OFF (12u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR5 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR5_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR5 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR5_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR5 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR5_OFF (15u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR6 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR6_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR6 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR6_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR6 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR6_OFF (18u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR7 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR7_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR7 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR7_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTR7 */
#define IFX_PMS_EVRBGOCTRL2_IREFTR7_OFF (21u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.SLCK */
#define IFX_PMS_EVRBGOCTRL2_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.SLCK */
#define IFX_PMS_EVRBGOCTRL2_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.SLCK */
#define IFX_PMS_EVRBGOCTRL2_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTRIMEN */
#define IFX_PMS_EVRBGOCTRL2_IREFTRIMEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTRIMEN */
#define IFX_PMS_EVRBGOCTRL2_IREFTRIMEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRBGOCTRL2_Bits.IREFTRIMEN */
#define IFX_PMS_EVRBGOCTRL2_IREFTRIMEN_OFF (31u)

/** \brief Length for Ifx_PMS_PMSW_CR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSW_CR0_ESR0DFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSW_CR0_ESR0DFEN_MSK (0x1u)

