Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_PMSW_CR2_Bits.TCINT */
#define IFX_PMS_PMSW_CR2_TCINT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_PMSW_CR2_Bits.TCINT */
#define IFX_PMS_PMSW_CR2_TCINT_OFF (16u)

/** \brief Length for Ifx_PMS_PMSW_CR2_Bits.TCINTREQ */
#define IFX_PMS_PMSW_CR2_TCINTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR2_Bits.TCINTREQ */
#define IFX_PMS_PMSW_CR2_TCINTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR2_Bits.TCINTREQ */
#define IFX_PMS_PMSW_CR2_TCINTREQ_OFF (24u)

/** \brief Length for Ifx_PMS_PMSW_CR2_Bits.SMURST */
#define IFX_PMS_PMSW_CR2_SMURST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR2_Bits.SMURST */
#define IFX_PMS_PMSW_CR2_SMURST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR2_Bits.SMURST */
#define IFX_PMS_PMSW_CR2_SMURST_OFF (25u)

/** \brief Length for Ifx_PMS_PMSW_CR2_Bits.RST */
#define IFX_PMS_PMSW_CR2_RST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR2_Bits.RST */
#define IFX_PMS_PMSW_CR2_RST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR2_Bits.RST */
#define IFX_PMS_PMSW_CR2_RST_OFF (26u)

/** \brief Length for Ifx_PMS_PMSW_CR3_Bits.WUTREL */
#define IFX_PMS_PMSW_CR3_WUTREL_LEN (24u)

/** \brief Mask for Ifx_PMS_PMSW_CR3_Bits.WUTREL */
#define IFX_PMS_PMSW_CR3_WUTREL_MSK (0xffffffu)

/** \brief Offset for Ifx_PMS_PMSW_CR3_Bits.WUTREL */
#define IFX_PMS_PMSW_CR3_WUTREL_OFF (0u)

/** \brief Length for Ifx_PMS_PMSW_CR3_Bits.WUTEN */
#define IFX_PMS_PMSW_CR3_WUTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR3_Bits.WUTEN */
#define IFX_PMS_PMSW_CR3_WUTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR3_Bits.WUTEN */
#define IFX_PMS_PMSW_CR3_WUTEN_OFF (27u)

/** \brief Length for Ifx_PMS_PMSW_CR3_Bits.WUTDIV */
#define IFX_PMS_PMSW_CR3_WUTDIV_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR3_Bits.WUTDIV */
#define IFX_PMS_PMSW_CR3_WUTDIV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR3_Bits.WUTDIV */
#define IFX_PMS_PMSW_CR3_WUTDIV_OFF (29u)

/** \brief Length for Ifx_PMS_PMSW_CR3_Bits.WUTMODE */
#define IFX_PMS_PMSW_CR3_WUTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR3_Bits.WUTMODE */
#define IFX_PMS_PMSW_CR3_WUTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR3_Bits.WUTMODE */
#define IFX_PMS_PMSW_CR3_WUTMODE_OFF (30u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.BPSCRSTREQ */
#define IFX_PMS_PMSW_CR4_BPSCRSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.BPSCRSTREQ */
#define IFX_PMS_PMSW_CR4_BPSCRSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.BPSCRSTREQ */
#define IFX_PMS_PMSW_CR4_BPSCRSTREQ_OFF (0u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.SCRSTREQ */
#define IFX_PMS_PMSW_CR4_SCRSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.SCRSTREQ */
#define IFX_PMS_PMSW_CR4_SCRSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.SCRSTREQ */
#define IFX_PMS_PMSW_CR4_SCRSTREQ_OFF (1u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.SCRFPISPI */
#define IFX_PMS_PMSW_CR4_SCRFPISPI_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.SCRFPISPI */
#define IFX_PMS_PMSW_CR4_SCRFPISPI_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.SCRFPISPI */
#define IFX_PMS_PMSW_CR4_SCRFPISPI_OFF (2u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.BPPORSTREQ */
#define IFX_PMS_PMSW_CR4_BPPORSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.BPPORSTREQ */
#define IFX_PMS_PMSW_CR4_BPPORSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.BPPORSTREQ */
#define IFX_PMS_PMSW_CR4_BPPORSTREQ_OFF (4u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.PORSTREQ */
#define IFX_PMS_PMSW_CR4_PORSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.PORSTREQ */
#define IFX_PMS_PMSW_CR4_PORSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.PORSTREQ */
#define IFX_PMS_PMSW_CR4_PORSTREQ_OFF (5u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.SCRCLKSEL */
#define IFX_PMS_PMSW_CR4_SCRCLKSEL_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.SCRCLKSEL */
#define IFX_PMS_PMSW_CR4_SCRCLKSEL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.SCRCLKSEL */
#define IFX_PMS_PMSW_CR4_SCRCLKSEL_OFF (6u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.SCRCFG */
#define IFX_PMS_PMSW_CR4_SCRCFG_LEN (8u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.SCRCFG */
#define IFX_PMS_PMSW_CR4_SCRCFG_MSK (0xffu)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.SCRCFG */
#define IFX_PMS_PMSW_CR4_SCRCFG_OFF (16u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.BPSCREN */
#define IFX_PMS_PMSW_CR4_BPSCREN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.BPSCREN */
#define IFX_PMS_PMSW_CR4_BPSCREN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.BPSCREN */
#define IFX_PMS_PMSW_CR4_BPSCREN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSW_CR4_Bits.SCREN */
#define IFX_PMS_PMSW_CR4_SCREN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR4_Bits.SCREN */
#define IFX_PMS_PMSW_CR4_SCREN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR4_Bits.SCREN */
#define IFX_PMS_PMSW_CR4_SCREN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSW_CR5_Bits.BPTRISTREQ */
#define IFX_PMS_PMSW_CR5_BPTRISTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR5_Bits.BPTRISTREQ */
#define IFX_PMS_PMSW_CR5_BPTRISTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR5_Bits.BPTRISTREQ */
#define IFX_PMS_PMSW_CR5_BPTRISTREQ_OFF (0u)

/** \brief Length for Ifx_PMS_PMSW_CR5_Bits.TRISTREQ */
#define IFX_PMS_PMSW_CR5_TRISTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR5_Bits.TRISTREQ */
#define IFX_PMS_PMSW_CR5_TRISTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR5_Bits.TRISTREQ */
#define IFX_PMS_PMSW_CR5_TRISTREQ_OFF (1u)

/** \brief Length for Ifx_PMS_PMSW_CR5_Bits.ESR0TRIST */
#define IFX_PMS_PMSW_CR5_ESR0TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR5_Bits.ESR0TRIST */
#define IFX_PMS_PMSW_CR5_ESR0TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR5_Bits.ESR0TRIST */
#define IFX_PMS_PMSW_CR5_ESR0TRIST_OFF (2u)

/** \brief Length for Ifx_PMS_PMSW_CR5_Bits.PORSTDF */
#define IFX_PMS_PMSW_CR5_PORSTDF_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR5_Bits.PORSTDF */
#define IFX_PMS_PMSW_CR5_PORSTDF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR5_Bits.PORSTDF */
#define IFX_PMS_PMSW_CR5_PORSTDF_OFF (4u)

/** \brief Length for Ifx_PMS_PMSW_CR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSW_CR5_DCDCSYNCO_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_CR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSW_CR5_DCDCSYNCO_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_CR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSW_CR5_DCDCSYNCO_OFF (6u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSW_STAT_HWCFGEVR_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSW_STAT_HWCFGEVR_MSK (0x3u)

