Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSW_STAT_HWCFGEVR_OFF (1u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.HWCFG4 */
#define IFX_PMS_PMSW_STAT_HWCFG4_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.HWCFG4 */
#define IFX_PMS_PMSW_STAT_HWCFG4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.HWCFG4 */
#define IFX_PMS_PMSW_STAT_HWCFG4_OFF (4u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.HWCFG5 */
#define IFX_PMS_PMSW_STAT_HWCFG5_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.HWCFG5 */
#define IFX_PMS_PMSW_STAT_HWCFG5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.HWCFG5 */
#define IFX_PMS_PMSW_STAT_HWCFG5_OFF (5u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.TRIST */
#define IFX_PMS_PMSW_STAT_TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.TRIST */
#define IFX_PMS_PMSW_STAT_TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.TRIST */
#define IFX_PMS_PMSW_STAT_TRIST_OFF (6u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.TESTMODE */
#define IFX_PMS_PMSW_STAT_TESTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.TESTMODE */
#define IFX_PMS_PMSW_STAT_TESTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.TESTMODE */
#define IFX_PMS_PMSW_STAT_TESTMODE_OFF (7u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSW_STAT_ESR0TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSW_STAT_ESR0TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSW_STAT_ESR0TRIST_OFF (8u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.PORSTDF */
#define IFX_PMS_PMSW_STAT_PORSTDF_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.PORSTDF */
#define IFX_PMS_PMSW_STAT_PORSTDF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.PORSTDF */
#define IFX_PMS_PMSW_STAT_PORSTDF_OFF (11u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.SCR */
#define IFX_PMS_PMSW_STAT_SCR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.SCR */
#define IFX_PMS_PMSW_STAT_SCR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.SCR */
#define IFX_PMS_PMSW_STAT_SCR_OFF (16u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.SCRST */
#define IFX_PMS_PMSW_STAT_SCRST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.SCRST */
#define IFX_PMS_PMSW_STAT_SCRST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.SCRST */
#define IFX_PMS_PMSW_STAT_SCRST_OFF (17u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.SCRCLK */
#define IFX_PMS_PMSW_STAT_SCRCLK_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.SCRCLK */
#define IFX_PMS_PMSW_STAT_SCRCLK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.SCRCLK */
#define IFX_PMS_PMSW_STAT_SCRCLK_OFF (18u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.PORSTREQ */
#define IFX_PMS_PMSW_STAT_PORSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.PORSTREQ */
#define IFX_PMS_PMSW_STAT_PORSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.PORSTREQ */
#define IFX_PMS_PMSW_STAT_PORSTREQ_OFF (19u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.WUTEN */
#define IFX_PMS_PMSW_STAT_WUTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.WUTEN */
#define IFX_PMS_PMSW_STAT_WUTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.WUTEN */
#define IFX_PMS_PMSW_STAT_WUTEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.WUTRUN */
#define IFX_PMS_PMSW_STAT_WUTRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.WUTRUN */
#define IFX_PMS_PMSW_STAT_WUTRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.WUTRUN */
#define IFX_PMS_PMSW_STAT_WUTRUN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSW_STAT_Bits.WUTMODE */
#define IFX_PMS_PMSW_STAT_WUTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT_Bits.WUTMODE */
#define IFX_PMS_PMSW_STAT_WUTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT_Bits.WUTMODE */
#define IFX_PMS_PMSW_STAT_WUTMODE_OFF (26u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSW_STAT2_ESR0WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSW_STAT2_ESR0WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSW_STAT2_ESR0WKP_OFF (0u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSW_STAT2_ESR1WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSW_STAT2_ESR1WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSW_STAT2_ESR1WKP_OFF (1u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PINAWKP */
#define IFX_PMS_PMSW_STAT2_PINAWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PINAWKP */
#define IFX_PMS_PMSW_STAT2_PINAWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PINAWKP */
#define IFX_PMS_PMSW_STAT2_PINAWKP_OFF (2u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PINBWKP */
#define IFX_PMS_PMSW_STAT2_PINBWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PINBWKP */
#define IFX_PMS_PMSW_STAT2_PINBWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PINBWKP */
#define IFX_PMS_PMSW_STAT2_PINBWKP_OFF (3u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PWRWKP */
#define IFX_PMS_PMSW_STAT2_PWRWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PWRWKP */
#define IFX_PMS_PMSW_STAT2_PWRWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PWRWKP */
#define IFX_PMS_PMSW_STAT2_PWRWKP_OFF (4u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.SCRWKP */
#define IFX_PMS_PMSW_STAT2_SCRWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.SCRWKP */
#define IFX_PMS_PMSW_STAT2_SCRWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.SCRWKP */
#define IFX_PMS_PMSW_STAT2_SCRWKP_OFF (5u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSW_STAT2_PORSTWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSW_STAT2_PORSTWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PORSTWKP */
#define IFX_PMS_PMSW_STAT2_PORSTWKP_OFF (6u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.WUTWKP */
#define IFX_PMS_PMSW_STAT2_WUTWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.WUTWKP */
#define IFX_PMS_PMSW_STAT2_WUTWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.WUTWKP */
#define IFX_PMS_PMSW_STAT2_WUTWKP_OFF (7u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSW_STAT2_ESR0OVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSW_STAT2_ESR0OVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.ESR0OVRUN */
#define IFX_PMS_PMSW_STAT2_ESR0OVRUN_OFF (8u)

