Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSW_STAT2_ESR1OVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSW_STAT2_ESR1OVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.ESR1OVRUN */
#define IFX_PMS_PMSW_STAT2_ESR1OVRUN_OFF (9u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSW_STAT2_PINAOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSW_STAT2_PINAOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PINAOVRUN */
#define IFX_PMS_PMSW_STAT2_PINAOVRUN_OFF (10u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSW_STAT2_PINBOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSW_STAT2_PINBOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PINBOVRUN */
#define IFX_PMS_PMSW_STAT2_PINBOVRUN_OFF (11u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSW_STAT2_SCROVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSW_STAT2_SCROVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.SCROVRUN */
#define IFX_PMS_PMSW_STAT2_SCROVRUN_OFF (13u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSW_STAT2_PORSTOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSW_STAT2_PORSTOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PORSTOVRUN */
#define IFX_PMS_PMSW_STAT2_PORSTOVRUN_OFF (14u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSW_STAT2_WUTOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSW_STAT2_WUTOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSW_STAT2_WUTOVRUN_OFF (15u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.STBYRAM */
#define IFX_PMS_PMSW_STAT2_STBYRAM_LEN (3u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.STBYRAM */
#define IFX_PMS_PMSW_STAT2_STBYRAM_MSK (0x7u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.STBYRAM */
#define IFX_PMS_PMSW_STAT2_STBYRAM_OFF (16u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSW_STAT2_BLNKFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSW_STAT2_BLNKFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSW_STAT2_BLNKFIL_OFF (20u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSW_STAT2_ESR0WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSW_STAT2_ESR0WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSW_STAT2_ESR0WKEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSW_STAT2_ESR1WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSW_STAT2_ESR1WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSW_STAT2_ESR1WKEN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSW_STAT2_PINAWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSW_STAT2_PINAWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSW_STAT2_PINAWKEN_OFF (26u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSW_STAT2_PINBWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSW_STAT2_PINBWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSW_STAT2_PINBWKEN_OFF (27u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSW_STAT2_PWRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSW_STAT2_PWRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSW_STAT2_PWRWKEN_OFF (28u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSW_STAT2_SCRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSW_STAT2_SCRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSW_STAT2_SCRWKEN_OFF (29u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSW_STAT2_PORSTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSW_STAT2_PORSTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSW_STAT2_PORSTWKEN_OFF (30u)

/** \brief Length for Ifx_PMS_PMSW_STAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSW_STAT2_WUTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSW_STAT2_WUTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSW_STAT2_WUTWKEN_OFF (31u)

/** \brief Length for Ifx_PMS_PMSW_UTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSW_UTCNT_WUTCNT_LEN (24u)

/** \brief Mask for Ifx_PMS_PMSW_UTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSW_UTCNT_WUTCNT_MSK (0xffffffu)

/** \brief Offset for Ifx_PMS_PMSW_UTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSW_UTCNT_WUTCNT_OFF (0u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSW_STATCLR_ESR0WKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSW_STATCLR_ESR0WKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSW_STATCLR_ESR0WKPCLR_OFF (0u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSW_STATCLR_ESR1WKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSW_STATCLR_ESR1WKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSW_STATCLR_ESR1WKPCLR_OFF (1u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PINAWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PINAWKPCLR_MSK (0x1u)

