Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PINAWKPCLR_OFF (2u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PINBWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PINBWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PINBWKPCLR_OFF (3u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PWRWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PWRWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PWRWKPCLR_OFF (4u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSW_STATCLR_SCRWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSW_STATCLR_SCRWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSW_STATCLR_SCRWKPCLR_OFF (5u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PORSTWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PORSTWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSW_STATCLR_PORSTWKPCLR_OFF (6u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSW_STATCLR_WUTWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSW_STATCLR_WUTWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSW_STATCLR_WUTWKPCLR_OFF (7u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_ESR0OVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_ESR0OVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_ESR0OVRUNCLR_OFF (8u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_ESR1OVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_ESR1OVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_ESR1OVRUNCLR_OFF (9u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PINAOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PINAOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PINAOVRUNCLR_OFF (10u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PINBOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PINBOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PINBOVRUNCLR_OFF (11u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_SCROVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_SCROVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_SCROVRUNCLR_OFF (13u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PORSTOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PORSTOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_PORSTOVRUNCLR_OFF (14u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_WUTOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_WUTOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSW_STATCLR_WUTOVRUNCLR_OFF (15u)

/** \brief Length for Ifx_PMS_PMSW_STATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSW_STATCLR_SCRSTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSW_STATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSW_STATCLR_SCRSTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSW_STATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSW_STATCLR_SCRSTCLR_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDSTAT0_Bits.ADCFBCV */
#define IFX_PMS_EVRSDSTAT0_ADCFBCV_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_MSK (0xfffu)
/** \brief Mask for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDSTAT0_Bits.DPWMOUT */
#define IFX_PMS_EVRSDSTAT0_DPWMOUT_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQSPRD_LEN (16u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQSPRD_MSK (0xffffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQSPRD_MSK (0xffffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQSPRD */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQSPRD_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQ_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQ_MSK (0xfffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQ_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.SDFREQ */
#define IFX_PMS_EVRSDCTRL_CTRL0_SDFREQ_OFF (16u)

