Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_NGOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_NGOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_NGOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.NGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_NGOFF_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_PGOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_PGOFF_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_PGOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.PGOFF */
#define IFX_PMS_EVRSDCTRL_CTRL0_PGOFF_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL_CTRL0_UP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL_CTRL0_UP_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL_CTRL0_UP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.UP */
#define IFX_PMS_EVRSDCTRL_CTRL0_UP_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL0_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL0_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL0_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL0_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL0_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TOFF_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TOFF_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TOFF_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TOFF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TON_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TON_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TON_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0TON_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0S0COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0S0COEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0S0COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0S0COEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0DEADBD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0DEADBD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0DEADBD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0DEADBD_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0ADCZB_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0ADCZB_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0ADCZB_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0ADCZB_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0SKIP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0SKIP_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0SKIP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL1_M0SKIP_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL_CTRL1_SYNCEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL_CTRL1_SYNCEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL_CTRL1_SYNCEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL_CTRL1_SYNCEN_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL1_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL1_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL1_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL1_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDOFFSET_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDOFFSET_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDOFFSET_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDOFFSET_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDWIDTH_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDWIDTH_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDWIDTH_MSK (0xfu)

