Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPBNDWIDTH_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPLPFCOEFF */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPLPFCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPLPFCOEFF */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPLPFCOEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPLPFCOEFF */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPLPFCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LPLPFCOEFF */
#define IFX_PMS_EVRSDCTRL_CTRL2_LPLPFCOEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.SDFREQLP */
#define IFX_PMS_EVRSDCTRL_CTRL2_SDFREQLP_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.SDFREQLP */
#define IFX_PMS_EVRSDCTRL_CTRL2_SDFREQLP_MSK (0xfffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.SDFREQLP */
#define IFX_PMS_EVRSDCTRL_CTRL2_SDFREQLP_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.SDFREQLP */
#define IFX_PMS_EVRSDCTRL_CTRL2_SDFREQLP_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.EVRCMOD */
#define IFX_PMS_EVRSDCTRL_CTRL2_EVRCMOD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.EVRCMOD */
#define IFX_PMS_EVRSDCTRL_CTRL2_EVRCMOD_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.EVRCMOD */
#define IFX_PMS_EVRSDCTRL_CTRL2_EVRCMOD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.EVRCMOD */
#define IFX_PMS_EVRSDCTRL_CTRL2_EVRCMOD_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL2_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL2_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL2_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL2_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TOFF_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TOFF_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TOFF_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TOFF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TON */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TON_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TON */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TON_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TON */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TON_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1TON */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1TON_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1S0COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1S0COEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1S0COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1S0COEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1DEADBD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1DEADBD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1DEADBD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1DEADBD_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1ADCZB_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1ADCZB_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1ADCZB_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1ADCZB_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1SKIP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1SKIP_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1SKIP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.M1SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL3_M1SKIP_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL3_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL3_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL3_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL3_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL3_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.VOKCFG */
#define IFX_PMS_EVRSDCTRL_CTRL4_VOKCFG_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.VOKCFG */
#define IFX_PMS_EVRSDCTRL_CTRL4_VOKCFG_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.VOKCFG */
#define IFX_PMS_EVRSDCTRL_CTRL4_VOKCFG_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.VOKCFG */
#define IFX_PMS_EVRSDCTRL_CTRL4_VOKCFG_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.SDFREQST */
#define IFX_PMS_EVRSDCTRL_CTRL4_SDFREQST_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.SDFREQST */
#define IFX_PMS_EVRSDCTRL_CTRL4_SDFREQST_MSK (0xfffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.SDFREQST */
#define IFX_PMS_EVRSDCTRL_CTRL4_SDFREQST_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.SDFREQST */
#define IFX_PMS_EVRSDCTRL_CTRL4_SDFREQST_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL4_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL4_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL4_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL4_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL4_LCK_OFF (31u)

