Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TOFF_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TOFF_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TOFF_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TOFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TOFF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TON */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TON_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TON */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TON_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TON */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TON_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2TON */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2TON_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2S0COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2S0COEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2S0COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2S0COEFF */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2S0COEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2DEADBD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2DEADBD_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2DEADBD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2DEADBD */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2DEADBD_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2ADCZB_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2ADCZB_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2ADCZB_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2ADCZB */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2ADCZB_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2SKIP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2SKIP_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2SKIP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.M2SKIP */
#define IFX_PMS_EVRSDCTRL_CTRL5_M2SKIP_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL5_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL5_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL5_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL5_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL5_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVINTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVINTH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVINTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVINTH_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVINTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVINTH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVINTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVINTH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVOTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVOTH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVOTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVOTH_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVOTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVOTH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SVOTH */
#define IFX_PMS_EVRSDCTRL_CTRL6_SVOTH_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCLO_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCLO_MSK (0x7u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCLO_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCLO */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCLO_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCHI_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCHI_MSK (0x7u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCHI_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.SINCHI */
#define IFX_PMS_EVRSDCTRL_CTRL6_SINCHI_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL6_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL6_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL6_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL6_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPV */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPV_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPV */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPV_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPV */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPV_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPV */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPV_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPCBF_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPCBF_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPCBF_MSK (0x3u)

