Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVPCBF */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVPCBF_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVP_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVP */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVP_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSLOMODE_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSLOMODE_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSLOMODE_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSLOMODE */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSLOMODE_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSPR_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSPR_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSPR_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.DRVSPR */
#define IFX_PMS_EVRSDCTRL_CTRL7_DRVSPR_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL_CTRL7_SYNCDIVFAC_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL_CTRL7_SYNCDIVFAC_MSK (0x7u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL_CTRL7_SYNCDIVFAC_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL_CTRL7_SYNCDIVFAC_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL7_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL7_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL7_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL7_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCOFFS_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCSMP_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCSMP_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCSMP_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCSMP_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCBLNK_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCBLNK_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCBLNK_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCBLNK_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLPF_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLPF_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLPF_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLPF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCERR_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCERR_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCERR_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCERR */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCERR_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLSB_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL_CTRL8_FBADCLSB_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL8_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL8_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL8_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL8_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCOFFS_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCLPF_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCLPF_MSK (0x7u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCLPF_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL_CTRL9_FFADCLPF_OFF (8u)

