Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL9_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL9_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL9_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL9_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVH_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVL_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCH_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCH_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCH_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCH */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCH_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCL_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCL_MSK (0x3fu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCL_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHCL */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHCL_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHHVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHHVEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHHVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHHVEN_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHLVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHLVEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHLVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL_CTRL10_SHLVEN_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL10_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL10_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL10_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL10_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL10_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVH_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVH_MSK (0x1fu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVH_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVL_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVL_MSK (0x1fu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVL_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL_CTRL11_DROOPVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMAXDEV_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMAXDEV_MSK (0x1fu)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMAXDEV_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMAXDEV_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCHYST_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCHYST_MSK (0x7u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCHYST_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCHYST_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMUXSEL_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMUXSEL_MSK (0x3u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMUXSEL_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL_CTRL11_SYNCMUXSEL_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL11_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL11_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCTRL_CTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL_CTRL11_LCK_MSK (0x1u)

