Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF0_M0S2VOSRC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF0_M0S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF0_M0S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF0_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF0_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF0_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF0_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFLPF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFLPF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFINC_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOUT_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VIN_MSK (0x7ffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF1_M0VIN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF1_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF1_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF1_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF1_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S0EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S0EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S0EN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S0EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S0EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S0EN_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2EN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2EN_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3EN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3EN_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3CLIP */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3CLIP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3CLIP */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3CLIP_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3CLIP */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3CLIP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3CLIP */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3CLIP_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4EN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4EN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4EN_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1RAMPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1RAMPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1RAMPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1RAMPEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1RAMPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1RAMPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1RAMPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1RAMPEN_OFF (5u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SFRGET */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SFRGET_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SFRGET */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SFRGET_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SFRGET */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SFRGET_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SFRGET */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SFRGET_OFF (6u)

