Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SKIPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SKIPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SKIPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SKIPEN_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SKIPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SKIPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SKIPEN */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SKIPEN_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3COEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S3COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S3COEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4COEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S4COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S4COEFF_OFF (12u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SRMPCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SRMPCOEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SRMPCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1SRMPCOEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1FGETCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1FGETCOEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1FGETCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1FGETCOEFF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2COEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2COEFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VINSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VINSRC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VINSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VINSRC_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VOSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VOSRC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.M1S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF2_M1S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF2_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF2_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF2_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF2_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF2_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFLPF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFLPF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFINC_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOUT_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VIN_MSK (0x7ffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF3_Bits.M1VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF3_M1VIN_OFF (16u)

