Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2COEFF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2COEFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VINSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VINSRC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VINSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VINSRC_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VOSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VOSRC_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF_COEFF4_M2S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF4_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF4_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF4_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF4_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF4_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFLPF_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFLPF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFINC_MSK (0xfu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOUT_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VIN_MSK (0x7ffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF_COEFF5_M2VIN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF5_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF5_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF5_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF5_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF5_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG0_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG0_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG0_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG0_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG1_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG1_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG1_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG1_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG2_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG2_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG2_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF6_CT5REG2_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF6_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF6_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF6_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF6_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF6_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG3_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG3_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG3_MSK (0xffu)

