Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG3_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG4_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG4_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG4_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.CT5REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF7_CT5REG4_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF7_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF7_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF7_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF7_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF7_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG0_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG0_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG0_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG0 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG0_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG1_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG1_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG1_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG1 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG1_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG2_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG2_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG2_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.CT33REG2 */
#define IFX_PMS_EVRSDCOEFF_COEFF8_CT33REG2_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF8_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF8_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF8_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF8_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF8_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG3_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG3_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG3_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG3 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG3_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG4_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG4_MSK (0xffu)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG4_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.CT33REG4 */
#define IFX_PMS_EVRSDCOEFF_COEFF9_CT33REG4_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF9_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF9_LCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF9_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF_COEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF_COEFF9_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_DTS_STAT_Bits.RESULT */
#define IFX_PMS_DTS_STAT_RESULT_LEN (12u)

/** \brief Mask for Ifx_PMS_DTS_STAT_Bits.RESULT */
#define IFX_PMS_DTS_STAT_RESULT_MSK (0xfffu)
/** \brief Mask for Ifx_PMS_DTS_STAT_Bits.RESULT */
#define IFX_PMS_DTS_STAT_RESULT_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTS_STAT_Bits.RESULT */
#define IFX_PMS_DTS_STAT_RESULT_OFF (0u)

/** \brief Length for Ifx_PMS_DTS_LIM_Bits.LOWER */
#define IFX_PMS_DTS_LIM_LOWER_LEN (12u)

/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.LOWER */
#define IFX_PMS_DTS_LIM_LOWER_MSK (0xfffu)
/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.LOWER */
#define IFX_PMS_DTS_LIM_LOWER_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTS_LIM_Bits.LOWER */
#define IFX_PMS_DTS_LIM_LOWER_OFF (0u)

/** \brief Length for Ifx_PMS_DTS_LIM_Bits.LLU */
#define IFX_PMS_DTS_LIM_LLU_LEN (1u)

/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.LLU */
#define IFX_PMS_DTS_LIM_LLU_MSK (0x1u)
/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.LLU */
#define IFX_PMS_DTS_LIM_LLU_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTS_LIM_Bits.LLU */
#define IFX_PMS_DTS_LIM_LLU_OFF (15u)

/** \brief Length for Ifx_PMS_DTS_LIM_Bits.UPPER */
#define IFX_PMS_DTS_LIM_UPPER_LEN (12u)

/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.UPPER */
#define IFX_PMS_DTS_LIM_UPPER_MSK (0xfffu)
/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.UPPER */
#define IFX_PMS_DTS_LIM_UPPER_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTS_LIM_Bits.UPPER */
#define IFX_PMS_DTS_LIM_UPPER_OFF (16u)

/** \brief Length for Ifx_PMS_DTS_LIM_Bits.SLCK */
#define IFX_PMS_DTS_LIM_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.SLCK */
#define IFX_PMS_DTS_LIM_SLCK_MSK (0x1u)
/** \brief Mask for Ifx_PMS_DTS_LIM_Bits.SLCK */
#define IFX_PMS_DTS_LIM_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTS_LIM_Bits.SLCK */
#define IFX_PMS_DTS_LIM_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_DTS_LIM_Bits.UOF */
#define IFX_PMS_DTS_LIM_UOF_LEN (1u)

